eu.alert-project.iccs.events.core/src/test/resources/ALERT.ALL.Recommender.ModuleRecommendationRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope  xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing"
            xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <soap:Header />
    <soap:Body >
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic/>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event
                            xmlns:ns1="http://www.alert-project.eu/"
                            xmlns:sc="http://www.alert-project.eu/socrates"
                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                            >
                        <ns1:head>
                            <ns1:sender>MLSensor</ns1:sender>
                            <ns1:timestamp>10000</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10010</ns1:endTime>
                                <!-- name of event -->
                                <ns1:eventName>ALERT.*.Recommender.ModuleRecommendationRequest</ns1:eventName>
                                <ns1:eventId>5748</ns1:eventId>
                                <ns1:eventType>Request</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <sc:ranking>0.0</sc:ranking>
                                <sc:identities>
                                    <sc:identity>
                                        <sc:uuid>51d8ecec1d6ea40106c6c71ffed13547010870b0ab57fe396f5fbb124967e0e1
                                        </sc:uuid>
                                    </sc:identity>
                                </sc:identities>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </soap:Body >
</soap:Envelope >